app/Models/m_approval.php

        $this->insert($newTransaction);

        // Update saldo in tb_tabungan table
        $hasil = $this->updateTabunganSaldo($existingTransaction['id_penabung'], $newSaldo);
---
UPDATE `tb_tabungan` SET `saldo` = 1300000
WHERE `id_penabung` = '2'