app/Models/m_user.php

SELECT `nipp`, `nama`, `email`, `password`, `id_role`, `tb_role`.`role` as `role`, `tb_role`.`description` as `desc`, `is_active`, `tb_user_status`.`description` as `status`, `created_date`
FROM `tb_auth`
JOIN `tb_role` ON `tb_auth`.`id_role` = `tb_role`.`id`
JOIN `tb_user_status` ON `tb_auth`.`is_active` = `tb_user_status`.`id`
---
    public function getUser()
    {
        // Fetch all user data from database with all the reference table
        $builder = $this->db->table('tb_auth');
        $builder->select('nipp, nama, email, password, id_role, tb_role.role as role, tb_role.description as desc, is_active, tb_user_status.description as status, created_date');
        $builder->join('tb_role', 'tb_auth.id_role = tb_role.id');
        $builder->join('tb_user_status', 'tb_auth.is_active = tb_user_status.id');
        $query = $builder->get();